In [1]:
import numpy as np
import pandas as pd

**문제1 : 학생들의 중간, 기말 고사 성적만으로 '총점'과 '평점' 추가하기**

In [56]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
                    {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
                    {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]

In [57]:
df = pd.DataFrame(friend_dict_list)
df

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

In [58]:
df.columns

Index(['이름', '중간고사점수', '기말고사점수'], dtype='object')

In [59]:
df['총점'] = 10
df

     이름  중간고사점수  기말고사점수  총점
0  나학생1      95      85  10
1  나학생2      85      80  10
2  나학생3      10      30  10

In [60]:
df['중간고사점수'] + df['기말고사점수']

0    180
1    165
2     40
dtype: int64

In [61]:
df['총점'] = df['중간고사점수'] + df['기말고사점수']
df

     이름  중간고사점수  기말고사점수   총점
0  나학생1      95      85  180
1  나학생2      85      80  165
2  나학생3      10      30   40

In [62]:

df

     이름  중간고사점수  기말고사점수   총점
0  나학생1      95      85  180
1  나학생2      85      80  165
2  나학생3      10      30   40

In [63]:
df['평균'] = df['총점']/2
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [64]:
df.columns

Index(['이름', '중간고사점수', '기말고사점수', '총점', '평균'], dtype='object')

In [65]:
# 단순 컬럼명만 반복해서 출력
# DataFrame으로 부터 시리즈 이름들만 반복반환해서 출력
for n in df:
    print(n,type(n))

이름 <class 'str'>
중간고사점수 <class 'str'>
기말고사점수 <class 'str'>
총점 <class 'str'>
평균 <class 'str'>

In [66]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [67]:
# DataFrame에 row별 반환 해서 활용
# iterrows() : DataFrame의 내부 데이터를 반복해서 하나씩 반환 할 수 있는 반복 기능의 API 사용
for v in df.iterrows():
    print(v, type(v))

(0, 이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균          90
Name: 0, dtype: object) <class 'tuple'>
(1, 이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균        82.5
Name: 1, dtype: object) <class 'tuple'>
(2, 이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균          20
Name: 2, dtype: object) <class 'tuple'>

In [68]:
# dataFrame의 데이터들을 하나하나 도출하기 위해서는 iterrows()를 활용해서 index를 Key, column명을 기준으로
# 한 row 단위로 착출해서 활용
# iterrows() 미사용 시에는 시리즈 이름만 반복문으로 착출 가능

for k, v in df.iterrows():
    print(k, '-', v)

0 - 이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균          90
Name: 0, dtype: object
1 - 이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균        82.5
Name: 1, dtype: object
2 - 이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균          20
Name: 2, dtype: object

In [69]:
# API 참고 : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html?highlight=series#pandas.Series


for index_name, v in df.iterrows():
    print(v, type(v))

이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균          90
Name: 0, dtype: object <class 'pandas.core.series.Series'>
이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균        82.5
Name: 1, dtype: object <class 'pandas.core.series.Series'>
이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균          20
Name: 2, dtype: object <class 'pandas.core.series.Series'>

In [70]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

**문제2 : DataFrame도 반복문으로 처리 가능 평균값을 반복문(for) 활용해서 출력해 보기**

In [71]:
for v in df.평균:
    print(v)

90.0
82.5
20.0

In [72]:
for v in df['평균']:
    print(v)

90.0
82.5
20.0

**문제3 : grade(등급) 이라는 컬럼 추가, 90점이상(A), 80점이상(B), 그외 F등급 조건식 활용해서 파이썬 코드로 처리해 보기**

In [73]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [74]:
grade = []

for avg in df['평균']:
    if avg >= 90:
        grade.append('A')
    elif avg >= 80:
        grade.append('B')
    else:
        grade.append('F')

grade

['A', 'B', 'F']

In [75]:
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [76]:
df['grade'] = grade
df

     이름  중간고사점수  기말고사점수   총점    평균 grade
0  나학생1      95      85  180  90.0     A
1  나학생2      85      80  165  82.5     B
2  나학생3      10      30   40  20.0     F

**문제4:'이수여부'라는 컬럼을 추가하되 등급을 기준으로 F인 경우 fail/F가 아닌 경우 pass 값으로 반영 단 lambda 문법으로 처리해 보기**

In [77]:
# apply() : 함수 호출 및 람다식적용시  사용하는 표현
# 조건식 적용시 if 조건식이 true인 경우 처리 로직은(반환값) if 키워드 앞단에 명시

# apply() : 이 함수를 호출하는 Series 객체에 존재하는 모든 row 수만큼 자동 호출
# 반복문 없이도 함수 호출

df['이수여부'] = df['grade'].apply(lambda grade : 'pass' if grade != 'F' else 'fail')
df

     이름  중간고사점수  기말고사점수   총점    평균 grade  이수여부
0  나학생1      95      85  180  90.0     A  pass
1  나학생2      85      80  165  82.5     B  pass
2  나학생3      10      30   40  20.0     F  fail

In [ ]:
'''
lambda식 이해를 위한 임시 함수 구현

def lamb(grade):
    if grade != 'F':
        return 'pass'
    else:
        return 'fail'
'''


# lambda식으로 변환
    
lambda grade : 'pass' if grade != 'F' else 'fail'

In [78]:
x = lambda a, b : a * b
print(x(5, 6))

30

In [80]:
# 곱한 결과가 30 이상인 경우에만 pass 30 미만인 경우 fail 반환하는 lambda식 구현

x = lambda a, b : 'pass' if a * b >= 30 else 'fail'
print(x(5, 6))
print(x(3, 5))

pass
fail

**문제5: apply 함수를 사용해서 년월일 정보에서 년에 해당하는 정보만 반환**

apply() 특징

1. pandas.core.series.Series 제공하는 함수
2. 람다식 적용해서 사용
> 람다식 : https://www.w3schools.com/python/python_lambda.asp
3. 사용자 정의 함수도 적용
4. 함수명이 parameter로 반영, 호출하고자 하는 함수의 parameter개수만큼 추가로 적용 가능
5. **호출 횟수는 Serise가 보유한 row수 데이터 수 만큼 자동 호출**
6. 내부 로직 : 반복 로직 포함

In [81]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
             {'yyyy-mm-dd': '2002-09-24'},
             {'yyyy-mm-dd': '2018-12-20'}]

df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [82]:
df['yyyy-mm-dd']

0    2000-06-27
1    2002-09-24
2    2018-12-20
Name: yyyy-mm-dd, dtype: object

In [85]:
# split() 하나의 문자열에서 - 기준으로 문자열들로 구성된 list로 변환
# 2000-06-27 : - 기준으로 나뉘어진 데이터를 3개의 토큰

v = '2000-06-27'.split('-')
print(v)

['2000', '06', '27']

In [90]:
for v in df['yyyy-mm-dd']:
    print(v, type(v))

2000-06-27 <class 'str'>
2002-09-24 <class 'str'>
2018-12-20 <class 'str'>

In [92]:
# 년도만 도출해서 출력
# String 따라서 split()으로 구분해서 첫번째 index값 반환
for v in df['yyyy-mm-dd']:
    data = v.split('-')   # ['2000', '06', '27']
    print(data[0])  # 2000

2000
2002
2018

In [96]:
# Slicing으로 yyyy값만 도출
for v in df['yyyy-mm-dd']:
    print(v[0:4])   # 0~3까지의 문자열 위치 즉 index값만 반환해서 출력

2000
2002
2018

In [97]:
# apply() + 사용자정의 함수를 어떻게 활용 가능한 것인가에 대한 학습
# 년도만 반환하는 사용자 정의 함수 구현

def get_year(row): # 'yyyy-mm-dd' 포멧으로 parameter가 유입된다 가정
    return row[0:4]

'''
print() -> get_year() 호출 -> 'yyyy-mm-dd' 문자열 데이터를 함수에게 처리 위임
-> 함수의 parameter 또는 argument인 row가 'yyyy-mm-dd' 받음
-> row[0:4] 으로 슬라이싱 -> return해서 호출한 곳으로 값을 넘김
-> print() 실제 출력
'''

print(get_year('yyyy-mm-dd'))

yyyy

In [98]:
def get_year(row): 
    
    return row[0:4]

In [99]:
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [101]:
# df['yyyy-mm-dd'] : 시리즈
# df['yyyy-mm-dd'].apply() : 시리즈 내에 저장된 데이터 즉 row 수만큼 함수 호출 의미 + 시리즈 데이터 제공

df['year'] = df['yyyy-mm-dd'].apply(get_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2018-12-20  2018

**문제 6 : gender별로 그룹화 하기**

In [102]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [106]:
# gender로 그룹화 : groupby()
# sql 비교시 group by 절과 유사, select * from DataFrame group by gender ..

df.groupby('gender')

In [107]:
# 그룹별 개수확인
df.groupby('gender').size()

gender
female    6
male      5
dtype: int64

In [109]:
# df의 그룹별 index 값 확인
df.groupby('gender').groups

{'female': [4, 5, 6, 8, 9, 10], 'male': [0, 1, 2, 3, 7]}

In [110]:
type(df.groupby('gender').groups)

pandas.io.formats.printing.PrettyDict

In [112]:
# 그룹별로 데이터를 하나씩 도출 문법
mg = df.groupby('major')
mg.size()

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [117]:
# 그룹별 상세 정보 확인 가능한 코드

# 코드 로직 대비 코드량이 굉장히 축소(추상화가 잘 되어있는 언어)
for index_name, v in mg:    
    print(index_name, '\n', v)
    print('-'*20)

Computer Science
        name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
--------------------
Economics
     name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female
--------------------
Physics
       name    major gender
2  Abraham  Physics   male
--------------------
Psychology
      name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female
--------------------

In [115]:
# 그룹별 index를 list 형식으로 반환

mg.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [120]:
# 각 그룹별 size 정보로 새로운 DataFrame 생성(데이터 활용도가 최상으로 극대화)
# rdbms 관점 : table 생성 / excel 관점에서도 table 생성

df1 = pd.DataFrame(mg.size())
df1

# 아쉬운점 : 컬럼명(시리즈명)이 0 즉 의미 없다!! 개선필요

                  0
major
Computer Science  4
Economics         3
Physics           1
Psychology        3

In [122]:
# DataFrame 생성시에 컬럼명을 부여해서 생성

df1 = pd.DataFrame({'count' : mg.size()})
df1

# 아쉬운점 : 생성시키고보니 컬럼명이 두개의 row로 표현이 되더라?

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [124]:
# 생성되는 DataFrame의 시리즈명 위치 재정리
# reset_index() : 컬럼(시리즈)명 재정리하는 주요한 함수
df1 = pd.DataFrame({'count' : mg.size()}).reset_index()
df1

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [128]:
gen = df.groupby('gender')
print(gen.size())

df2 = pd.DataFrame({'count' : gen.size()}).reset_index()
print(df2)

df2 = pd.DataFrame({'count' : df.groupby('gender').size()}).reset_index()
print(df2)

gender
female    6
male      5
dtype: int64
   gender  count
0  female      6
1    male      5
   gender  count
0  female      6
1    male      5